from typing import List, Dict

# 검증 코드 (한 줄 출력 + 분류 정확도 체크)

CORRECT_DICT = {
    "버": ["버킷건축", "버터건축"],
    "라": ["라이트건축", "라스트건축", "라임건축", "라온건축"],
    "히": ["히히히건축", "히라건축", "히어로건축", "히밥건축"],
    "타": ["타코건축", "타워건축", "타자건축"],
    "나": ["나무건축", "나방건축", "나가건축", "나래건축"],
    "머": ["머메이드건축", "머그건축", "머물건축", "머핀건축"],
    "커": ["커피건축", "커널건축", "커넥션건축"],
    "서": ["서리건축", "서정건축", "서원건축", "서브건축", "서클건축"],
    "파": ["파라솔건축", "파도건축", "파랑건축", "파란하늘건축"],
    "더": ["더블건축", "더원건축", "더존건축"],
    "자": ["자연건축", "자몽건축", "자전거건축"],
    "허": ["허튼건축", "허브건축"],
    "카": ["카멜건축", "카페건축", "카메라건축", "카누건축"],
    "가": ["가자건축", "가온건축", "가설건축"],
    "마": ["마당건축", "마이웨이건축", "마시멜로건축", "마루건축"],
    "아": ["아침건축", "아치건축", "아틀리에건축", "아미고건축"],
    "저": ["저스틴건축", "저널건축", "저울건축", "저녁건축"],
    "거": ["거점건축", "거목건축", "거북건축", "거상건축"],
    "처": ["처마건축", "처리건축"],
    "바": ["바람건축", "바닐라건축", "바톤건축", "바오건축"],
    "퍼": ["퍼레이드건축", "퍼센트건축", "퍼스트건축"],
    "하": ["하이파이브건축", "하루건축", "하얀건축"],
    "어": ["어니언건축", "어드레스건축", "어드벤처건축"],
    "다": ["다리건축", "다온건축", "다섯건축", "다락건축"],
    "러": ["러브건축", "러너건축", "러쉬건축"],
    "차": ["차일드건축", "차근건축", "차가운건축", "차오름건축", "차박건축"],
    "터": ["터닝건축", "터널건축", "터치건축"],
    "너": ["너울건축", "너비건축"],
    "사": ["사람건축", "사랑건축", "사계건축", "사리건축"],
}


def verify_dict_submission(submitted_dict: Dict):
    correct_items = [(k, sorted(v)) for k, v in sorted(CORRECT_DICT.items())]
    submitted_items = [(k, sorted(v)) for k, v in sorted(submitted_dict.items())]
    for correct_item, submitted_item in zip(correct_items, submitted_items):
        if correct_item != submitted_item:
            print(f"정답: {correct_item}")
            print(f"제출: {submitted_item}")
            break
    dict_ok = correct_items == submitted_items

    print(f"정답 여부 : {dict_ok} ")

    if not dict_ok:
        # 틀린 키 찾기
        wrong_keys = [
            k
            for k in CORRECT_DICT
            if set(CORRECT_DICT[k]) != set(submitted_dict.get(k, []))
        ]
        if wrong_keys:
            print("틀린 키:", wrong_keys)
